feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/iLLD/TC27D/Tricore/_PinMap/IfxGtm_PinMap.c
IfxGtm_Tom_ToutMap IfxGtm_TOM2_11_TOUT105_P10_3_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_11, IfxGtm_ToutSel_b, 105, {&MODULE_P10, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_11_TOUT108_P10_6_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_11, IfxGtm_ToutSel_b, 108, {&MODULE_P10, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_11_TOUT134_P22_8_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_11, IfxGtm_ToutSel_a, 134, {&MODULE_P22, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_11_TOUT63_P20_7_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_11, IfxGtm_ToutSel_b, 63, {&MODULE_P20, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_11_TOUT71_P15_0_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_11, IfxGtm_ToutSel_b, 71, {&MODULE_P15, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_12_TOUT102_P10_0_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_12, IfxGtm_ToutSel_b, 102, {&MODULE_P10, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_12_TOUT135_P22_9_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_12, IfxGtm_ToutSel_a, 135, {&MODULE_P22, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_12_TOUT34_P33_12_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_12, IfxGtm_ToutSel_b, 34, {&MODULE_P33,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_12_TOUT72_P15_1_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_12, IfxGtm_ToutSel_b, 72, {&MODULE_P15, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_13_TOUT110_P10_8_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_13, IfxGtm_ToutSel_b, 110, {&MODULE_P10, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_13_TOUT136_P22_10_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_13, IfxGtm_ToutSel_a, 136, {&MODULE_P22,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_13_TOUT35_P33_13_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_13, IfxGtm_ToutSel_b, 35, {&MODULE_P33,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_13_TOUT65_P20_9_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_13, IfxGtm_ToutSel_b, 65, {&MODULE_P20, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_13_TOUT73_P15_2_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_13, IfxGtm_ToutSel_b, 73, {&MODULE_P15, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_14_TOUT137_P22_11_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_14, IfxGtm_ToutSel_a, 137, {&MODULE_P22,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_14_TOUT36_P32_0_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_14, IfxGtm_ToutSel_b, 36, {&MODULE_P32, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_14_TOUT66_P20_10_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_14, IfxGtm_ToutSel_b, 66, {&MODULE_P20,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_14_TOUT74_P15_3_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_14, IfxGtm_ToutSel_b, 74, {&MODULE_P15, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_15_TOUT149_P34_4_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_15, IfxGtm_ToutSel_a, 149, {&MODULE_P34, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_15_TOUT67_P20_11_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_15, IfxGtm_ToutSel_b, 67, {&MODULE_P20,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_15_TOUT75_P15_4_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_15, IfxGtm_ToutSel_b, 75, {&MODULE_P15, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_1_TOUT120_P11_1_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_a, 120, {&MODULE_P11, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_1_TOUT47_P22_0_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_b, 47, {&MODULE_P22, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_1_TOUT54_P21_3_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_b, 54, {&MODULE_P21, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_1_TOUT95_P11_2_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_b, 95, {&MODULE_P11, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_2_TOUT121_P11_4_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_2, IfxGtm_ToutSel_a, 121, {&MODULE_P11, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_2_TOUT46_P23_5_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_2, IfxGtm_ToutSel_b, 46, {&MODULE_P23, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_2_TOUT55_P21_4_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_2, IfxGtm_ToutSel_b, 55, {&MODULE_P21, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_2_TOUT88_P14_8_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_2, IfxGtm_ToutSel_b, 88, {&MODULE_P14, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_2_TOUT96_P11_3_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_2, IfxGtm_ToutSel_b, 96, {&MODULE_P11, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_3_TOUT122_P11_5_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_a, 122, {&MODULE_P11, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_3_TOUT49_P22_2_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_b, 49, {&MODULE_P22, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_3_TOUT56_P21_5_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_b, 56, {&MODULE_P21, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_3_TOUT60_P20_1_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_b, 60, {&MODULE_P20, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_3_TOUT89_P14_9_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_b, 89, {&MODULE_P14, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_3_TOUT97_P11_6_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_b, 97, {&MODULE_P11, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_4_TOUT123_P11_7_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_a, 123, {&MODULE_P11, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_4_TOUT50_P22_3_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_b, 50, {&MODULE_P22, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_4_TOUT57_P21_6_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_b, 57, {&MODULE_P21, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_4_TOUT61_P20_3_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_b, 61, {&MODULE_P20, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_4_TOUT90_P14_10_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_b, 90, {&MODULE_P14,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_4_TOUT98_P11_9_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_b, 98, {&MODULE_P11, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_5_TOUT124_P11_8_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_a, 124, {&MODULE_P11, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_5_TOUT58_P21_7_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_b, 58, {&MODULE_P21, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_5_TOUT91_P13_0_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_b, 91, {&MODULE_P13, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_5_TOUT99_P11_10_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_b, 99, {&MODULE_P11,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_6_TOUT100_P11_11_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_b, 100, {&MODULE_P11,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_6_TOUT106_P10_4_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_b, 106, {&MODULE_P10, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_6_TOUT125_P11_13_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_a, 125, {&MODULE_P11,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_6_TOUT59_P20_0_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_b, 59, {&MODULE_P20, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_6_TOUT92_P13_1_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_b, 92, {&MODULE_P13, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_7_TOUT101_P11_12_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_b, 101, {&MODULE_P11,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_7_TOUT126_P11_14_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_a, 126, {&MODULE_P11,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_7_TOUT130_P22_4_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_a, 130, {&MODULE_P22, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_7_TOUT64_P20_8_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_b, 64, {&MODULE_P20, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_7_TOUT93_P13_2_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_b, 93, {&MODULE_P13, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_8_TOUT109_P10_7_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_8, IfxGtm_ToutSel_b, 109, {&MODULE_P10, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_8_TOUT127_P11_15_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_8, IfxGtm_ToutSel_a, 127, {&MODULE_P11,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_8_TOUT131_P22_5_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_8, IfxGtm_ToutSel_a, 131, {&MODULE_P22, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_8_TOUT51_P21_0_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_8, IfxGtm_ToutSel_b, 51, {&MODULE_P21, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_8_TOUT68_P20_12_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_8, IfxGtm_ToutSel_b, 68, {&MODULE_P20,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_9_TOUT103_P10_1_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_9, IfxGtm_ToutSel_b, 103, {&MODULE_P10, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_9_TOUT132_P22_6_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_9, IfxGtm_ToutSel_a, 132, {&MODULE_P22, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_9_TOUT52_P21_1_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_9, IfxGtm_ToutSel_b, 52, {&MODULE_P21, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_9_TOUT69_P20_13_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_9, IfxGtm_ToutSel_b, 69, {&MODULE_P20,13}, IfxPort_OutputIdx_alt1};

